In [12]:
import pandas as pd

In [13]:
df1 = pd.DataFrame({'Name':['Amol', 'Ajit'], 'Age':[25,26]})

In [14]:
df2 = pd.DataFrame({'Name':['Ash', 'Amit'], 'Age':[21,29]})

In [19]:
pd.concat([df1,df2], ignore_index = True)

   Name  Age
0  Amol   25
1  Ajit   26
2   Ash   21
3  Amit   29

In [20]:
pf3=pd.DataFrame({'Name':['Rupesh','Abhishek','Kiran','Pratik','Ajay'],'Scores':[20,40,70,90,40]})

In [21]:
pf4=pd.DataFrame({'Name':['Rupesh','Abhishek','Kiran','Pratik','Pragati'],'School':['ABC', 'XYZ','ZAE','AMX','ZXW']})

In [22]:
pd.merge(pf3,pf4, on = 'Name', how = 'inner')

       Name  Scores School
0    Rupesh      20    ABC
1  Abhishek      40    XYZ
2     Kiran      70    ZAE
3    Pratik      90    AMX

In [23]:
pd.merge(pf3,pf4, on = 'Name', how = 'outer')

       Name  Scores School
0    Rupesh    20.0    ABC
1  Abhishek    40.0    XYZ
2     Kiran    70.0    ZAE
3    Pratik    90.0    AMX
4      Ajay    40.0    NaN
5   Pragati     NaN    ZXW

In [24]:
pd.merge(pf3,pf4, on = 'Name', how = 'left')

       Name  Scores School
0    Rupesh      20    ABC
1  Abhishek      40    XYZ
2     Kiran      70    ZAE
3    Pratik      90    AMX
4      Ajay      40    NaN

In [25]:
pd.merge(pf3,pf4, on = 'Name', how = 'right')

       Name  Scores School
0    Rupesh    20.0    ABC
1  Abhishek    40.0    XYZ
2     Kiran    70.0    ZAE
3    Pratik    90.0    AMX
4   Pragati     NaN    ZXW